In [1]:
import pandas as pd

In [3]:
지하철_좌표 = pd.read_csv('지하철역_좌표.csv')

# Windows 한글 인코딩 (CP949 또는 EUC-KR)로 읽기
지하철_역명 = pd.read_csv("C:/Users/say87/Documents/big_data_analysis_contest/부산교통공사_도시철도 역명정보_20240930.csv", encoding='cp949')

In [5]:
지하철_좌표.head()

   SWST_ID    TZ_AREA_VAL  TZ_AREA_XCRDT_VAL  TZ_AREA_YCRDT_VAL    DATE_UPD
0      100  2110058020014         128.970955          35.088275  2022-07-19
1      101  2110059010001         128.960565          35.091202  2022-07-19
2      102  2110056020006         128.966655          35.105667  2022-07-19
3      103  2110055030007         128.973159          35.104463  2022-07-19
4      104  2110054020005         128.982843          35.101077  2022-07-19

In [6]:
# import pandas as pd

# 1. CSV 또는 이미 로드된 두 데이터프레임
# 지하철_역명 = pd.read_csv('지하철_역명.csv', encoding='cp949')
# 지하철_좌표 = pd.read_csv('지하철_좌표.csv', encoding='cp949')

# 2. 컬럼명이 정확히 아래와 같다고 가정
# 지하철_역명: ['역번호', '역명']
# 지하철_좌표: ['SWST_ID', 'TZ_AREA_XCRDT_VAL', 'TZ_AREA_YCRDT_VAL']

# 3. 병합 (역번호와 SWST_ID 기준)
지하철 = pd.merge(
    지하철_역명[['역번호', '역명']],
    지하철_좌표[['SWST_ID', 'TZ_AREA_XCRDT_VAL', 'TZ_AREA_YCRDT_VAL']],
    left_on='역번호',
    right_on='SWST_ID',
    how='inner'
)

# 4. 필요한 컬럼만 선택
지하철 = 지하철[['역명', 'TZ_AREA_XCRDT_VAL', 'TZ_AREA_YCRDT_VAL']]

# 5. CSV 저장
# 지하철.to_csv('지하철.csv', encoding='utf-8', index=False)

In [7]:
지하철.head()

        역명  TZ_AREA_XCRDT_VAL  TZ_AREA_YCRDT_VAL
0  다대포해수욕장         128.965340          35.050268
1     다대포항         128.971290          35.057729
2       낫개         128.992370          35.050865
3      신장림         128.978174          35.072813
4       장림         128.981961          35.078850

In [8]:
지하철.to_csv('지하철.csv', encoding='utf-8', index=False)

In [15]:
지하철 = pd.read_csv('지하철.csv')
# 지하철[지하철['역명'=='경성대·부경대역']]

In [14]:
지하철[지하철['역명'] == '경성대·부경대']

         역명  TZ_AREA_XCRDT_VAL  TZ_AREA_YCRDT_VAL
51  경성대·부경대         129.100453          35.136953

In [23]:
지하철[지하철['역명'] == '부산역']

     역명  TZ_AREA_XCRDT_VAL  TZ_AREA_YCRDT_VAL
18  부산역         129.048439          35.119652

In [ ]:
경성대·부경대

In [16]:
버스 = pd.read_csv('버스정류장_좌표.csv')

In [27]:
버스[버스['STN_NM']=='(구)MBC방송국']
# 같은 이름의 역 중에 노드와 가장 가까이에 있는 역을 들른다고 가정함.

Empty DataFrame
Columns: [STN_CD, LONGITUDE, LATITUDE, STN_NM, LOAD_DATE]
Index: []

In [24]:
관광 = pd.read_csv('관광_3요소.csv')

In [26]:
관광[관광['LOC_NM']=='몰운대']

     Unnamed: 0 LOC_NM   LATITUDE   LONGITUDE  관광_지하철  관광_숙박  관광_식음
21           21    몰운대  35.046382  128.968007       1      1     41
90           90    몰운대  35.046382  128.968007       1      1     41
159         159    몰운대  35.046382  128.968007       1      1     41